app/controllers/links_controller.rb

SELECT "links".* FROM "links"
---
  def index
    @links = Link.all

INSERT INTO "links" ("title", "URL", "html", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    # configs
    @splash_host = '68.42.117.7:8050'

    @link = Link.new(link_params)

    # print params
    puts link_params

    # hit Splash and get HTML
    url_string = "http://#{@splash_host}/render.html?url=#{link_params['URL']}&wait=1"
    rendered_html =  open(url_string).read
    @link.html = rendered_html

    # load into Nokogiri and extract title
    parsed_html = Nokogiri::HTML(rendered_html)
    title = parsed_html.css('title').text
    if title == ""
      @link.title = "Unknown Title"
    else
      @link.title = title
    end

    # hit Splash and get thumbnail
    url_string = "http://#{@splash_host}/render.png?url=#{link_params['URL']}&wait=1&width=320&height=240"
    @link.picture_from_url(url_string)


    respond_to do |format|
      if @link.save

UPDATE "links" SET "html" = ?, "updated_at" = ? WHERE "links"."id" = ?  [["html", "<p>Helllloooo World!</p>\r\n<p>This is plumb shit amazing.</p>"], ["updated_at", "2015-05-17 19:22:55.809509"], ["id", 1]]
---
  def update
    puts link_params
    respond_to do |format|
      if @link.update(link_params)

DELETE FROM "links" WHERE "links"."id" = ?  [["id", 3]]
---
  def destroy
    @link.destroy

SELECT  "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", 3]]
---
    def set_link
      @link = Link.find(params[:id])